Repository: Fryguy/zanata-client
Catalog: zanata-maven-plugin/demo-glossary/compendium/*.po
Languages: de

source: process
de: Prozess

source: implementation
de: Implementierung

source: disk drive
de: Festplatte

source: mouse
de: Maus

source: disaster
de: Katastrophe

source: system adminstrator
de: Systemadministrator

source: organization
de: Organisation

source: hardware failure
de: Hardware-Ausfall

source: software failure
de: Software-Ausfall

source: environmental failure
de: Umgebungs-Ausfall

source: human errors
de: Menschliches Versagen

source: Spare Hardware
de: Ersatz-Hardware

source: spares
de: Ersatzteile

source: skills
de: Kompetenz

source: maintenance contract
de: Wartungsvertrag

source: downtime
de: Ausfallzeit

source: data center
de: Datencenter

source: service contract
de: Servicevertrag

source: hours of coverage
de: Verfügungsstunden

source: response time
de: Reaktionszeit

source: on site
de: vor Ort

source: approach
de: Herangehensweise

source: availability
de: Verfügbarkeit

source: operating system
de: Betriebssystem

source: support
de: Unterstützung

source: policy
de: Richtlinie

source: interceptor stack configuration
de: Interceptor Stack-Konfiguration

source: application
de: Anwendung

source: to update
de: aktualisieren

source: Note
de: Anmerkung

source: Tip
de: Tipp

source: Important
de: Wichtig

source: Warning
de: Warnung

source: Caution
de: Achtung

source: Additional Resources
de: Zusätzliche Informationsquellen

source: Useful Websites
de: Hilfreiche Websites

source: utility
de: Dienstprogramm

source: to mount
de: einhängen

source: mount point
de: Einhängepunkt

source: vulnerability
de: Schwachstelle

source: exploit
de: Sicherheitslücke

source: credentials
de: Berechtigungsnachweise

source: custom
de: angepasst/benutzerdefiniert

source: advisory
de: Hinweis

source: synopsis
de: Übersicht

source: base channel
de: Basis-Channel

source: child channel
de: Sub-Channel

source: physical
de: physisch

source: circular reference
de: Zirkelbezug

source: desktop panel
de: Menüleiste

source: notification tray
de: Benachrichtigungsfeld

source: to purge
de: komplett entfernen

source: performance
de: Leistung

source: access control list
de: Zugriffskontrollliste

source: scripts
de: Skripte

source: bytecode enhancing
de: Bytecode-Anreicherung

source: workstation
de: Arbeitsplatzrechner

source: unmount
de: aushängen

source: NFS share
de: NFS-Freigabe

source: tab
de: Reiter

source: service
de: Dienst

source: button
de: Schaltfläche

source: asterisk
de: Sternchen

source: Samba share
de: Samba-Freigabe

source: directive
de: Direktive

source: statement
de: Anweisung

source: to listen
de: horchen (auf einen Port ~)

source: repository
de: Repository (das)

source: interface
de: Schnittstelle

source: graphical (user) interface
de: grafische (Benutzer)Oberfläche

source: How It Works
de: Funktionsweise

source: binary
de: Binärdatei

source: binaries
de: Binärdateien

source: abstraction
de: Abstraktion

source: accessor
de: Zugriffsberechtigter

source: address overflow
de: Adressüberschreitung

source: anti-pattern
de: Negativmuster

source: AOP applications
de: AOP-Applikationen

source: application role
de: Anwendungsrolle

source: application server implementation
de: Applikationsserver-Implementierung

source: Application Server Clustering
de: Applikationsserver-Clustering

source: applications isolation
de: Anwendungsisolierung

source: arbitrary
de: beliebig

source: argument
de: Parameter

source: assign
de: zuweisen, zuteilen, bestimmen, festsetzen

source: associated
de: angeschlossen, angegliedert, verbunden, verknüpft, zugehörig

source: association
de: Assoziation

source: attribute
de: Attribut

source: authentication
de: Authentifizierung, auch: Authentifikation

source: Automatic Dirty Checking
de: automatische Modifizierungsprüfung

source: bean
de: Bean (das)

source: bean shell scripts
de: Bean-Shell-Skripts

source: before completion phase
de: Vorabschlussphase

source: bidirectional
de: bidirektional

source: binding IP address
de: Binding-IP-Adresse (die zugewiesene IP-Adresse)

source: buffer
de: Puffer, Zwischenspeicher

source: buffer overflow
de: Pufferüberlauf

source: bundle
de: bündeln

source: by definition
de: definitionsgemäß

source: Cache
de: Cachespeicher, Cache (der)

source: cache region
de: Cache-Bereich

source: Caching
de: Caching, Zwischenspeichern

source: Certificate Authority
de: Zertifizierungsstelle

source: CA
de: Zertifizierungsstelle

source: volume
de: Datenträger

source: volume group
de: Datenträgergruppe

source: physical volume
de: physischer Datenträger

source: logical volume
de: logischer Datenträger

source: to create
de: erstellen, erzeugen, anlegen

source: e.g.
de: z.B. (ohne Leerzeichen)

source: i.e.
de: d.h. (ohne Leerzeichen)

source: certificate chain
de: Zertifikatskette

source: certified application server
de: zertifizierter Applikationsserver

source: channel partners
de: Channel Partner, auch: Vertriebspartner

source: class name
de: Klassenname

source: classloader
de: Klassenlader

source: classpath
de: Klassenpfad

source: client-side interceptors
de: Clientbasierte Interzeptoren

source: clustering architectures
de: Clustering-Architekturen

source: command line
de: Befehlszeile

source: concurrent
de: gleichlaufend, gleichzeitig, simultan, nebenläufig

source: configuration attribute
de: Konfigurationseigenschaft

source: configuration directory
de: Konfigurationsverzeichnis

source: configuration files
de: Konfigurationsdateien

source: configuration set
de: Konfigurationseinstellungen

source: configuration set selection screen
de: Auswahlfenster für die Konfigurationseinstellungen

source: conversion
de: Datenkonvertierung

source: core service
de: Kerndienst

source: data file
de: Datendatei

source: data model
de: Datenbankmodell, auch: Datenmodell

source: default
de: Standardeinstellung

source: default location
de: Standard-Speicherstelle

source: default value
de: Standardwert, voreingestellter Wert

source: directory structure
de: Verzeichnisstruktur

source: DTD
de: DTD, kurz für Document Type Definition, Dokumenttyp-Definition

source: Email Notification Process
de: E-Mail Benachrichtigungsprozess

source: Encoding algorithm
de: Verschlüsselungsalgorithmus

source: End-Customer Fulfillment Notice
de: Auslieferungsbestätigung an den Kunden

source: EAI
de: EAI, Enterprise Application Integration

source: entry point
de: Einsprungpunkt, Einsprungstelle

source: environment
de: Umgebung

source: fully qualified name
de: vollständiger Name

source: FQN
de: vollständiger Name

source: garbage collection
de: automatische Speicherbereinigung

source: global
de: allgemeingültig

source: gzipped
de: mit GZIP komprimiert

source: Integrity constraint
de: Integritätsbedingung

source: lazy fetching
de: “Lazy Fetching”, Nachladen assoziierter Objekte bei Bedarf

source: legacy data
de: Altdaten, Stammdaten

source: library
de: Bibliothek

source: load
de: Auslastung

source: load balancer
de: Lastverteiler

source: load-balancing factor
de: Lastverteilungsfaktor

source: local network
de: lokales Netzwerk

source: locally bound objects
de: lokal gebundene Objekte

source: location
de: Speicherstelle

source: log file
de: Protokolldatei

source: logging file
de: Protokolldatei

source: method call
de: Methodenaufruf

source: nest (to)
de: verschachteln

source: network traffic
de: Netzwerkverkehr

source: No-Arg-Constructor
de: Konstruktor ohne Parameter

source: Output
de: Ausgabe, auch: Output, Meldung

source: overflow
de: Überlauf

source: package
de: Paket

source: package selection screen
de: Paket-Auswahlfenster

source: parameterize
de: parametrieren

source: partition name
de: Partitionsname

source: path
de: Pfad

source: pathname
de: Pfadname

source: polymorphism
de: Polymorphie

source: portable
de: übertragbar

source: Primary Key
de: Primärschlüssel

source: replication queue
de: Replikationswarteschlange

source: request
de: Anfrage

source: security configuration
de: Sicherheitskonfiguration

source: security configuration screen
de: Bildschirm zur Sicherheitskonfiguration

source: sent in the clear
de: unverschlüsselt verschickt

source: server configuration
de: Server-Konfiguration

source: server configuration name
de: Server-Konfigurationsname

source: server instance
de: Server-Instanz

source: Server Load Balancing
de: Serverlastverteilung

source: server profile
de: Server-Profil

source: top-level directory
de: Verzeichnis der obersten Ebene, Ursprungspunkt der Verzeichnishierarchie

source: UUID
de: UUID, kurz für Universally Unique Identifier

source: SSO
de: SSO, kurz für Single Sign On

source: Command Line Option
de: Befehlszeilenoption

source: concurrency control
de: Nebenläufigkeitskontrolle

source: recoverable
de: wiederherstellbar

source: event
de: Ereignis

source: snippet
de: Codestück

source: initializer
de: Initialisierungsprogramm

source: typecast
de: Typumwandlung

source: fatal exception error
de: schwerer Ausnahmefehler

source: indexed
de: indiziert

source: getter and setter methods
de: Getter- und Setter-Methoden

source: optimistic locking
de: optimistisches Sperren

source: surrogat key
de: Surrogatschlüssel

source: increment
de: Erhöhung

source: increment (to)
de: erhöhen

source: isolation level
de: Isolationsebene

source: backwards compatibility
de: Abwärtskompatibilität

source: cartesian product
de: kartesisches Produkt

source: component type
de: Komponententyp

source: typesafe
de: typsicher

source: new-line character
de: Zeilenvorschubzeichen

source: Installation image
de: Installations-Image

source: IDE
de: Integrierte Entwicklungsumgebung

source: API
de: API, Programmierschnittstelle (Application Programming Interface)

source: JSP
de: JSP, JavaServerPage

source: MVC
de: MVC, Model-View-Controller (wörtlich etwa „Modell-Präsentation-Steuerung“)

source: reference guide
de: Referenzhandbuch

source: source code
de: Quellcode

source: source file
de: Quelldatei

source: snapshot
de: Zwischensicherung, auch “Snapshot”

source: snapshot mode
de: Zwischensicherungsmodus, auch Snapshot-Modus

source: physical extend
de: physische (Speicher-) Einheiten

source: label
de: Kennung

source: flag
de: Flag (das)

source: share-level security
de: Sicherheit auf Freigabenebene

source: user-level security
de: Sicherheit auf Benutzerebene

source: revision history
de: Änderungsverzeichnis

source: guest operating system
de: Gastbetriebssystem

source: to parse
de: analysieren

source: Reauthentication
de: Wiederauthentifizierung

source: block device
de: Blockgerät, blockorientiertes Gerät

source: character device
de: Zeichengerät, zeichenorientiertes Gerät

source: chip set
de: Chip-Satz

source: re-base
de: grundlegend verändern

source: socket
de: Socket (der)

source: entitlement
de: Berechtigung

source: subscription
de: Abonnement

source: remote
de: Remote-, von Remote aus

source: remote logging
de: Protokollieren von Remote aus

source: command line option
de: Befehlszeilenoption

source: command line argument
de: Befehlszeilenparameter

source: stack
de: Stapel

source: driver stack
de: Treiberstapel

source: read-only
de: schreibgeschützt

source: memory leak
de: Speicherleck

source: virtualization
de: Virtualisierung

source: host
de: Host (der)

source: guest
de: Gast

source: fully virtualized guest
de: voll virtualisierter Gast

source: paravirtualized guest
de: paravirtualisierter Gast

source: full virtualization
de: volle Virtualisierung

source: paravirtualization
de: Paravirtualisierung

source: dependency
de: Abhängigkeit

source: file system
de: Dateisystem

source: object store
de: Objektspeicher

source: property file
de: Eigenschaftsdatei

source: quota
de: Kontingent

source: user quota
de: Benutzerkontingente

source: disk quota
de: Festplattenkontingente

source: fence
de: abgrenzen

source: fence method
de: Methode zur Datenabgrenzung

source: fence device
de: Gerät zur Datenabgrenzung

source: file descriptor
de: Dateideskriptor

source: to scale
de: skalieren

source: CPU speed scaling
de: CPU Geschwindigkeitsskalierung

source: kernel oops error message
de: CPU Geschwindigkeitsskalierung

source: to migrate
de: migrieren

source: to resolve dependencies
de: Abhängigkeiten auflösen

source: name space
de: Namensraum

source: thread
de: Thread (der)

source: quick reference
de: Kurzanleitung

source: to compile
de: kompilieren

source: compiled
de: kompiliert

source: to cache
de: cachen, zwischenspeichern

source: debugging
de: Suche und Bereinigung von Programmfehlern (Debugging) (nur einmal EN in Klammern)

source: troubleshooting
de: Suche und Beseitigung von Fehlern (Troubleshooting) (nur einmal EN in Klammern)

source: image
de: Image (das) (nur bei Fedora: Abbild)

source: guest image
de: Gast-Image

source: file-based image
de: dateibasiertes Image

source: relocation server
de: Migrations-Server

source: relocation port
de: Migrations-Port

source: python deprecation error
de: Python-Fehler (Deprecation)

source: deprecated
de: veraltet

source: remote management
de: Remote-Verwaltung

source: domain
de: Domain (die)

source: resource
de: Ressource

source: extension
de: Erweiterung

source: Technology Preview
de: Technologievorschau

source: Known Issues
de: Bekannte Probleme

source: Resolved Issues
de: Behobene Probleme

source: Installation-Related Notes
de: Installationsbezogene Hinweise

source: Real-Time Clock (RTC)
de: Echtzeituhr (engl. Real Time Clock, RTC)

source: loopback device
de: Loopback-Gerät

source: throughput
de: Durchsatz, Datendurchsatz

source: kickstart
de: Kickstart (der)

source: kickstart file
de: Kickstart-Datei

source: hypervisor
de: Hypervisor (der)

source: home directory
de: Benutzerverzeichnis

source: installation tree
de: Installationsbaum

source: mirror
de: Spiegelserver

source: processor context switching, context switch
de: Kontextwechsel des Prozessors

source: bridge
de: Bridge (die)

source: traffic
de: Datenverkehr

source: daemon
de: Daemon (der)

source: subnet
de: Subnetz

source: gateway
de: Gateway (das)

source: netmask
de: Netzmaske

source: license agreement
de: Lizenzvereinbarung

source: dump
de: Speicherauszug

source: password
de: Passwort

source: wizard
de: Assistent

source: runlevel
de: Runlevel (der)

source: partition table
de: Partitionstabelle

source: Boolean
de: Boolscher Operator (bei AND, OR, etc)

source: loadbalancing
de: Lastverteilung

source: interrupt
de: Interrupt (der)

source: Getting Started Guide
de: Handbuch zum Einstieg - Erste Schritte

source: nested
de: verschachtelt

source: back-end
de: Backend (das)

source: resource record
de: Ressourceneintrag

source: aliases
de: Aliasse

source: intrusion detection systems (IDS)
de: Intrusion-Detection-Systeme (IDS)

source: Related Books
de: Weiterführende Literatur

source: idle task
de: Leerlaufprozess

source: one-way hash
de: unidirektionaler Hash

source: system request key
de: Systemabfragetaste

source: regular expression
de: regulärer Ausdruck

source: name resolution
de: Namensauflösung

source: binary translation
de: Binärübersetzung

source: latency
de: Latenz

source: instruction set
de: Befehlssatz

source: keyboard layout
de: Tastaturbelegung

source: listening mode
de: Lauschmodus

source: pull-quote
de: Seitenansprache

source: locale
de: Gebietsschema

source: Lookup Table (LUT)
de: Lookup-Tabelle (LUT)

source: array
de: Array (das)

source: Services Configuration Tool
de: Services Configuration Tool (App. ist nicht lokalisiert, also engl. Name)

source: shadow password
de: Shadow-Passwort

source: Mission Statement
de: Firmenphilosophie

source: driver update
de: Treiberaktualisierung

source: driver update disk
de: Datenträger zur Treiberaktualisierung

source: driver update disk image
de: Datenträger-Image zur Treiberaktualisierung

source: driver disk
de: Treiberdatenträger

source: to IPL the system
de: einen IPL des Systems durchführen, einleitendes Programmladen durchführen

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
de: Dieses Programm ist freie Software. Sie können es unter den Bedingungen der GNU General Public License, wie von der Free Software Foundation veröffentlicht, weitergeben und/oder modifizieren, entweder gemäß Version 2 der Lizenz oder (nach Ihrer Option) jeder späteren Version. Die Veröffentlichung dieses Programms erfolgt in der Hoffnung, dass es Ihnen von Nutzen sein wird, aber OHNE IRGENDEINE GARANTIE, sogar ohne die implizite Garantie der MARKTREIFE oder der VERWENDBARKEIT FÜR EINEN BESTIMMTEN ZWECK. Details finden Sie in der GNU General Public License. Sie sollten ein Exemplar der GNU General Public License zusammen mit diesem Programm erhalten haben. Falls nicht, schreiben Sie an die Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA

source: video card
de: Grafikkarte

source: crossover cable
de: Crossover-Kabel

source: patch cable
de: Patch-Kabel

source: screenshot
de: Screenshot (der) (nur bei Fedora: Bildschirmfoto)

source: query
de: Abfrage

source: Installation Guide
de: Installationshandbuch

source: prompt (noun)
de: Eingabeaufforderung

source: Bugfix
de: Fehlerbehebung

source: hibernation
de: Ruhezustand

source: x display manager
de: X-Anzeigemanager

source: deployment guide
de: Deployment-Handbuch

source: content-based routing
de: inhaltsbasiertes Routing

source: latency tracer
de: Latency Tracer (wohl am besten), evtl. auch Latenz-Tracer

source: connection factory
de: Verbindungs-Factory

source: escape character
de: Maskierungszeichen, auch Fluchtsymbol

source: to deploy
de: einsetzen, implementieren - NICHT deployen, deployt etc.

source: XYZ Quick Start Guide
de: Handbuch zum schnellen Einstieg in die/das XYZ

source: EL expression
de: EL-Ausdruck

source: well-formed
de: wohlgeformt

source: HTML controls
de: HTML-Steuerelemente

source: payload
de: Nutzdaten

source: thread of control
de: Kontroll-Thread

source: protocol agnostic
de: protokollunabhängig

source: stateful
de: zustandsbehaftet

source: stateless
de: zustandslos

source: pluggable
de: modular, zuschaltbar

source: scope
de: Sichtbarkeitsbereich (von Variablen) ...?, Geltungsbereich einer Transaktion

source: Preemption
de: zeitweise Unterbrechung

source: address space
de: Adressbereich

source: power management
de: Energieverwaltung

source: join type
de: Verbundtyp

source: privacy statement
de: Datenschutzerklärung

source: namespace
de: Namensraum

source: cross-cutting concerns
de: querschnittlichen Belange

source: commodity hardware
de: Standardhardware

source: registry
de: Registrierung

source: Workaround
de: Problemumgehung

source: authoritative
de: autoritativ

source: nagle -> den "Nagle"-Algorithmus anwenden
de: den Nagle-Algorithmus anwenden

source: tracing
de: Ablaufverfolgung

source: Instrumentation
de: Instrumentation, Instrumentierung

source: hard / weak / soft / reference
de: harte / schwache / weiche Referenz

source: FAQ
de: FAQ; Häufig gestellte Fragen

source: menu bar
de: Menüleiste

source: sanity check
de: Integritätsprüfung

source: to unlock
de: entsperren

source: flow control
de: Flusskontrolle

source: postback
de: Postback (der)

source: union clause
de: Union-Klausel

source: primary key
de: Primärschlüssel

source: string representation
de: Stringdarstellung

source: data record
de: Datensatz

source: checksum
de: Prüfsumme

source: authentication
de: Authentifizierung

source: checkbox
de: Kontrollkästchen

source: race condition
de: Wettlaufsituation

source: strong typing
de: starke Typisierung

source: event queue
de: Ereignis-Queue

source: eviction
de: Eviction (die)

source: to evict
de: räumen, entfernen

source: introspection
de: Introspektion

source: data alignment
de: Speicherausrichtung

source: self-signed
de: selbstbestätigt

source: roles summary
de: Rollenübersicht

source: Initial draft
de: Erstentwurf

source: power of two
de: Zweierpotenz

source: upwards compatibility
de: Aufwärtskompatibilität

source: file protection mode
de: Dateischutzmodus

source: hook
de: Hook (der)

source: iterative
de: iterativ

source: single point of failure
de: einzelner Ausfallpunkt

source: failover
de: Ausfallsicherung

source: failover to another cluster node
de: zur Ausfallsicherung auf einen anderen Cluster-Knoten wechseln

source: bijection
de: Bijektion

source: patch
de: Patch (der)

source: security vulnerability
de: Sicherheitslücke

source: scripting language
de: Skriptsprache

source: Boolean expression
de: boolescher Ausdruck

source: pie chart
de: Kreisdiagramm

source: bar chart
de: Balkendiagramm

source: line chart
de: Liniendiagramm

source: Graphical Installer
de: Grafischer Installer

source: production environment
de: Produktionsumgebung

source: acknowledge mode
de: Bestätigungsmodus

source: audit trail
de: Audit-Protokoll

source: security breach
de: Sicherheitslücke

source: user credentials
de: Benutzerdaten

source: search domain
de: Suchdomäne
